{
/* Passphrase panel titles */
"MESSAGE_AUTHENTICATION_TITLE" = "Authentification du message";
"MESSAGE_DECRYPTION_PASSPHRASE_TITLE" = "Déchiffrement du message";

/**/
"DECRYPTING" = "Déchiffrement...";
"ENCRYPTING" = "Chiffrement...";

/* <PGP> submenu title */
"PGP_MENU" = "PGP";
/* <PGP Keys> submenu title */
"PGP_KEYS_MENU" = "Clefs PGP";

/* <PGP> submenu items */
"DECRYPT_MENU" = "Déchiffrement";
"AUTHENTICATE_MENU" = "Vérification";
"ENCRYPT_MENU" = "Chiffrement du message";
"SIGN_MENU" = "Signature du message";

/* Description of version prefixed with <Version:> */
"VERSION: %@" = "Version : %@";

/* PGP preferences panel name */
"PGP_PREFERENCES" = "PGP";

/* Alert title and message */
"MSG_DECRYPTION_ALERT_TITLE_NOT_SIGNED" = "Déchiffrement du message";
"DECRYPTED_MSG_NOT_SIGNED" = "Le message a été chiffré mais pas signé. Son authenticité n'a pas pu être prouvée.";
"MSG_ENCRYPTION_ALERT_TITLE" = "Le chiffrement par PGP a échoué";
"MSG_DECRYPTION_ALERT_TITLE" = "Le déchiffrement par PGP a échoué";
"MSG_SIGNING_ALERT_TITLE" = "La signature par PGP a échoué";
"UNSUPPORTED_ENCRYPTION_FORMAT" = "GPGMail n'est pas capable de lire ce genre de message.";
"DATA_NOT_AVAILABLE" = "Le contenu du message est temporairement indisponible.";

/* Informational alert title and message */
"AUTHENTICATION_TITLE_OK" = "Authentification par PGP";

/**/
"AUTHENTICATION_TITLE_FAILED" = "L'authentification par PGP a échoué";
"TRY_AGAIN" = "Réessayer";
"CANCEL_DELIVERY" = "Annuler";
"CANCEL_DECRYPTION" = "Annuler";

/**/
"AUTHENTICATION_TITLE_UNSIGNED" = "Authentification par PGP";
"UNSIGNED_PGP_MESSAGE" = "Ce message n'a pas été signé avec PGP.";

/* Toolbar item titles */
"DECRYPT_ITEM" = "Déchiffrer";
"AUTHENTICATE_ITEM" = "Authentifier";
"MAKE_ENCRYPTED_ITEM" = "Chiffrer";
"MAKE_CLEAR_ITEM" = "Laisser en clair";
"MAKE_UNSIGNED_ITEM" = "Ne pas signer";
"MAKE_SIGNED_ITEM" = "Signer";
"ENCRYPTED_ITEM" = "Chiffré";
"CLEAR_ITEM" = "En clair";
"SIGNED_ITEM" = "Signé";
"UNSIGNED_ITEM" = "Non signé";

/* Toolbar item tooltips  */
"DECRYPT_ITEM_TOOLTIP" = "Déchiffrement de message chiffré avec PGP";
"AUTHENTICATE_ITEM_TOOLTIP" = "Authentification de message signé avec PGP";
"MAKE_CLEAR_ITEM_TOOLTIP" = "Cliquez pour envoyer le message en clair";
"MAKE_ENCRYPTED_ITEM_TOOLTIP" = "Cliquez pour chiffrer avec PGP";
"MAKE_UNSIGNED_ITEM_TOOLTIP" = "Cliquez pour envoyer le message sans signature PGP";
"MAKE_SIGNED_ITEM_TOOLTIP" = "Cliquez pour utiliser l'authentification PGP";
"ENCRYPTED_ITEM_TOOLTIP" = "Le message va être chiffré avec PGP ; cliquez pour envoyer le message en clair";
"CLEAR_ITEM_TOOLTIP" = "Le message va être en clair ; cliquez pour chiffrer avec PGP";
"SIGNED_ITEM_TOOLTIP" = "Le message va être signé avec PGP ; cliquez pour envoyer le message sans signature PGP";
"UNSIGNED_ITEM_TOOLTIP" = "Le message n'a pas de signature PGP ; cliquez pour utiliser l'authentification PGP";

/* Signature information */
"Bad policy! "  = "Politique non valide! "; // Followed by a list of policy URLs
"Policy: " = "Politique: "; // Followed by a list of policy URLs
"Signed on %@" = "Signé le %@"; // Param is a date, whose format is set by SIGNATURE_CREATION_DATE_FORMAT
"SIGNATURE_CREATION_DATE_FORMAT" = "%c"; // See NSCalendarDate documentation for format
"No signature creation date available" = "Aucune date de création de signature disponible";
"Key fingerprint: %@" = "Empreinte : %@";
"Key ID: 0x%@" = "ID de clef : 0x%@";
"No key fingerprint/ID available" = "Pas d'empreinte ou d'ID de clef disponible";
"Validity: %@" = "Validité : %@"; // Param is the validity status string
"Signature expires on %@" = "Signature expirant le %@"; // Param is a date, whose format is set by SIGNATURE_EXPIRATION_DATE_FORMAT
"SIGNATURE_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Key expired on %@" = "La clef a expiré le %@"; // Param is a date, whose format is set by KEY_EXPIRATION_DATE_FORMAT
"KEY_EXPIRATION_DATE_FORMAT" = "%x"; // See NSCalendarDate documentation for format
"Signed by %@." = "Signé par %@."; // Param is a userID
"Signature from %@ is bad!" = "Mauvaise signature de %@ !"; // Param us a userID
"Signature is bad!" = "Mauvaise signature!";
"Signature status error." = "Erreur de status avec la signature.";
"MISSING KEY %@." = "Clef %@ manquante."; // Param is a key ID in hexadecimal
"Signature summary 0x%04x - Signature status %u." = "Erreur inconnue : résumé de signature 0x%04x - status de signature %u."; // Generic error message; first param is a hex status flag value, second is a decimal status value
"EXCEPTION: %@" = "Erreur interne: %@"; // Generic error message; param is a string (exception reason, maybe not localized)
"AUTHENTICATING" = "Vérification de la signature PGP...";
"UNTRUSTED RECIPIENTS" = "Au moins une des clefs n'est pas de confiance";

/* Title */
/* Error messages */
"GPGMAIL_CANNOT_WORK" = "GPGMail ne peut pas fonctionner parce que son application conjointe n'a pas pu être démarrée. Essayez de redémarrer Mail et si cette erreur persiste, envoyez un message à gpgmail@sente.ch";
"GPGMAIL_CANNOT_WORK_HAS_GPG_%@_VERSION_%@_NEEDS_%@" = "GPGMail ne peut pas fonctionner. Il a trouvé GnuPG (%@) version %@, mais il a besoin de la version %@ (ou plus récente). Veuillez quitter Mail, installer une nouvelle version de GnuPG (par exemple depuis le site de MacGPG Project, http://macgpg.sourceforge.net/), puis redémarrer Mail."; // First arg is path to gpg, second and third are version strings
"GPGMAIL_CANNOT_WORK_MISSING_GPG_%@_VERSION_%@" = "GPGMail ne peut pas fonctionner. Il n'a pas trouvé de version de GnuPG (%@) aussi récente que la %@. Veuillez quitter Mail, installer une nouvelle version de GnuPG (par exemple depuis le site de MacGPG Project, http://macgpg.sourceforge.net/), puis redémarrer Mail."; // First arg is path to gpg, second is version string
"INVALID_GPGMAIL_VERSION" = "Votre version de GPGMail n'est pas compatible avec votre version de Mail."; /* Title of alert sheet */
"NEEDS_COMPATIBLE_BUNDLE_VERSION" = "Vous devez télécharger et installer la version de GPGMail correspondant à votre version du système. Allez-la prendre à l'adresse http://www.sente.ch/software/GPGMail/French.lproj/";
        
/* Validity */
"VALIDITY: " = "validité : ";
"Validity=0" = "inconnue";
"Validity=1" = "indéfinie";
"Validity=2" = "jamais";
"Validity=3" = "marginale";
"Validity=4" = "complète";
"Validity=5" = "ultime";

/* Generic MacGPGME error messages */
"GPGErrorCode=1" = "Erreur générale";
"GPGErrorCode=8" = "Mauvaise signature";
"GPGErrorCode=9" = "Pas de clef publique";
"GPGErrorCode=10" = "Erreur de somme de contrôle";
"GPGErrorCode=11" = "Mauvais mot de passe";
"GPGErrorCode=15" = "Armure ASCII invalide";
"GPGErrorCode=17" = "Pas de clef secrète";
"GPGErrorCode=31" = "Mot de passe invalide";
"GPGErrorCode=40" = "Erreur de serveur de clefs";
"GPGErrorCode=53" = "Clef publique non utilisable";
"GPGErrorCode=54" = "Clef secrète non utilisable";
"GPGErrorCode=55" = "Valeur invalide";
"GPGErrorCode=58" = "Pas de donnée";
"GPGErrorCode=69" = "Pas implémenté";
"GPGErrorCode=84" = "Algorithme non supporté";
"GPGErrorCode=94" = "Clef révoquée";
"GPGErrorCode=99" = "Annulé";
"GPGErrorCode=107" = "Nom ambigu";
"GPGErrorCode=116" = "Pas de politique correspondante";
"GPGErrorCode=125" = "Mauvaise utilisation de clef";
"GPGErrorCode=150" = "Moteur invalide";
"GPGErrorCode=151" = "Clef publique sans confiance";
"GPGErrorCode=152" = "Déchiffrement échoué";
"GPGErrorCode=153" = "Clef expirée";
"GPGErrorCode=154" = "Signature expirée";
"GPGErrorCode=16383" = "EOF";

/* Signature attachment filename (suffixed automatically by .sig) */
"PGP_SIGNATURE_FILENAME" = "PGP";

/* Signature attachment content-description */
"This is a digitally signed message part" = "Ceci est une signature électronique PGP";

/* Version MIME part content description header */
"CONTENT_DESCRIPTION_HEADER" = "Identifiant de la version de PGP/MIME";

/* Encrypted attachment filename (suffixed automatically by .asc) */
"PGP_ENCRYPTED_FILENAME" = "FichierPGP";

/* Encrypted attachment content-description */
"This is an encrypted message part" = "Partie du message avec chiffrement PGP";

/* Multiple-part description */
"MULTIPART_ENCRYPTED_DESCRIPTION" = "Ceci est une message chiffré selon OpenPGP/MIME (RFC 2440 et 3156)";
"MULTIPART_SIGNED_DESCRIPTION" = "Ceci est une message signé électroniquement selon OpenPGP/MIME (RFC 2440 et 3156)";

/* Tooltip for banner icons */
"SIGNATURE_IS_GOOD" = "La signature est bonne ; le message n'a pas été modifié";
"SIGNATURE_IS_NOT_GOOD" = "La signature est mauvaise ; le message a été modifié";

/* PGP Key Download panel */
"PGP_SEARCH_KEYS_MENUITEM" = "Recherche de clef PGP";
"SEARCH" = "Recherche";
"CANCEL_SEARCH" = "Annuler";
"SEARCHING" = "Recherche...";
"NO_MATCHING_KEYS" = "Aucune clef correspondante";
"FOUND_%d_KEYS" = "%d clef(s) correspondante(s)";
"DOWNLOAD" = "Télécharger";
"DOWNLOADING" = "Téléchargement...";
"DOWNLOADED" = "Clef(s) téléchargés(s) et importée(s)";
"SEARCH_KEYS_ON_SERVER" = "Recherche de clefs PGP sur le serveur de clefs";
"DOWNLOAD_KEYS_FROM_SERVER" = "Télécharger les clefs PGP depuis le serveur de clefs";
"SEARCH_ERROR" = "Une erreur est survenue durant la recherche";
"DOWNLOAD_ERROR" = "Une erreur est survenue durant le téléchargement";
" (%u bits)" = " (%u bits)";
", created on %@" = ", créée le %@";
", expires on %@" = ", expirant le %@";
", expired on %@" = ", expirée le %@";
"REVOKED_KEY - " = "Révoquée - "; // Prefixes found key description, when necessary; followed by keyID, userID, etc.

/* Unmatched PGP keys for receipts - sheet */
"MISSING_KEYS: DOWNLOAD" = "Des destinataires n'ont pas de clef PGP correspondante. Rechercher les clefs ?"; // Title
"UNMATCHED_ADDRESSES: %@" = "Les adresses email suivantes n'ont pas de clef PGP correspondante:\n%@"; // Message
"SEARCH_MATCHING_KEYS" = "Rechercher"; // Default button
"SEND_IN_CLEAR" = "Envoyer en clair"; // button title; used in dialog after delivery failure due to missing public keys

"INVALID_HASH_%@" = "L'algorithme de chiffrement '%@' n'est pas autorisé selon RFC3156.";
"GPGMAIL_VS_PGPMAIL" = "GPGMail ne peut pas fonctionner quand PGPmail est installé.";
"GPGMAIL_%@_VS_PGPMAIL_%@" = "Les deux outils fournissent les mêmes fonctionnalités, avec des moteurs différents, et un seul des deux peut être installé. Vous devez retirer soit '%@', soit '%@'.";
"QUIT" = "Quitter";
"CONTINUE_ANYWAY" = "Continuer";

/* Composer accessory view header, under To:, CC:, Subject: */
"PGP:" = "PGP :";

/* Key description in popups; prefixes key (actually, primary userID), when necessary; followed by keyID, userID, etc.*/
"REVOKED_KEY:" = "Révoquée:";
"EXPIRED_KEY:" = "Expirée:";
"DISABLED_KEY:" = "Désactivée:";
"INVALID_KEY:" = "Invalide:";

/* UserID description in popups; prefixes userID, when necessary; followed by name, email, etc.*/
"REVOKED_USER_ID:" = "Révoqué:";
"INVALID_USER_ID:" = "Invalide:";

/* GPGMail exception reasons */
"NO_VALID_PUBLIC_KEY" = "Aucune clé publique valide n'a été trouvée. Elles sont toutes soit expirées, désactivées ou révoquées."; // Could be displayed after encryption
"NO_VALID_PRIVATE_KEY" = "Aucune clé personnelle valide n'a été trouvée. Soit il n'y en avait aucune de sélectionnée, ou alors la clé est soit révoquée, désactivée ou a expiré."; // Could be displayed after encryption

/* Alert when user has no PGP key */
"NO PGP PRIVATE KEY - TITLE" = "Vous n'avez aucune clé PGP. Vous ne pouvez pas utilisez GPGMail pour chiffrer ou signer un message.";
"NO PGP PRIVATE KEY - MESSAGE" = "Si vous voulez pouvoir chiffrer ou signer un message avec PGP, vous avez besoin d'une clé personnelle PGP. Pour créer une clé PGP, téléchargez et installez GPG Keychain Access depuis le site http://macgpg.sourceforge.net/fr/";

/* Conflict resolution panel*/
"<ME>" = "Moi";
"<YES>" = "Oui";
"<NO>" = "Non";
"<ALWAYS>" = "Toujours";
"<NEVER>" = "Jamais";
"<ACCEPTS>" = "Accepté";

/* Additional info describing key */
"DISABLED_KEY_QUALIFIER" = "désactivée";
"INVALID_KEY_QUALIFIER" = "invalide";
"REVOKED_KEY_QUALIFIER" = "révoquée";
"EXPIRED_KEY_QUALIFIER" = "expirée";
"CANNOT_ENCRYPT_KEY_QUALIFIER" = "ne peut chiffrer";
"CANNOT_SIGN_KEY_QUALIFIER" = "ne peut signer";

/* Additional info describing userID */
"INVALID_USER_ID_QUALIFIER" = "invalide";
"REVOKED_USER_ID_QUALIFIER" = "révoqué";

"COPY_MSG_URL_MENUITEM" = "Copier l'URL du message";
}